<template>
  <div id="agreement">
    <h1>“人人当地主”产品销售协议</h1>

    <p>甲方（卖方）：大田县高峰茶业有限公司（以下简称甲方）</p>
    <p>乙方（买方）： <span class="space"></span>（以下简称乙方）</p>

    <p>经乙方确认，需购买甲方APP上“人人当地主”产品。乙方确认对产品了解并接受甲方APP上所表述的产品内容及所表达的含义。为维护甲乙双方的权益，本协议经乙方阅读并选择同意后，作为合同履行的一部分。</p>

    <h2>一、产品情况：</h2>
    <p>乙方向甲方购买“人人当地主”产品，产品详见<i>APP上所示</i>，甲方向乙方保证所购买的茶园认养收益权无抵押、无担保、无债务、无权属争议。</p>
    <h2>二、茶园概况</h2>
    <p>茶园的地名：福建省大田县屏山乡 美阳村大坪格 。乙方受让认养收益权的茶园为上述区域内茶园。</p>
    <h2>三、支付结算方式</h2>
    <p>乙方认可甲方APP上产品，乙方通过甲方APP向指定账户足额支付款项。</p>
    <p>甲方账户信息如下：</p>
    <p>户名：<b class="underline">大田县高峰茶业有限公司</b></p>
    <p>开户行：<i class="underline">大田县农村信用合作联社岩城信用社</i></p>
    <p>账号：<i class="underline">9030725010010910732226</i></p>
    <h2>四、乙方的茶园收益权实现</h2>
    <h3>（一）乙方茶园收益权</h3>
    <p><b>乙方可以选择以下方案一及方案二中的其中一种实现收益：</b></p>
    <h4>方案一：</h4>
      <ul>
    <li>1、甲方按《附件一》中产品清单确定的数量及时交付茶叶，茶叶交付时间以乙方通知为准，在甲方发出交茶指令后，乙方应及时安排收领茶业。</li>
        <li>2、甲方负责交付的产品在以下区域内：内蒙古、新疆、西藏、港、澳、台及国外，物流费用由乙方自行承担。</li>
        <li>3、收益获取方式：乙方通过甲方APP选择茶叶的领取方式，甲方APP允许乙方客户选择包装，包装费用需另行付费。</li>
      </ul>
    <h4>方案二</h4>
      <ul>
    <li>1、收益：乙方可委托甲方对乙方茶园收益茶业进行代销。</li>
        <li>2、收益获取方式：乙方在每季度可委托甲方进行代销当季度的茶叶收益，其中首季度只能在90天后进行。代销后甲方将乙方委托的销售收入（预计年化收益率为9%~12%）转入乙方所在甲方平台账户的余额中，到账时间为：T+15。</li>
        <li>3、如乙方选择本方案实现认养收益时，乙方不得向甲方申请开具发票。</li>
        <li>4、季度的起始以乙方付款购买开始计算，每90天为一个季度；</li></ul>

    <h2>五、违约责任</h2>
    <p>如因客观甲方原因未能按照约定方式提供茶叶，则应当在下一季度补齐，如甲方无故终止本协议，则应按照<i class="underline bold">398</i>元/斤标准，对未完成的茶叶数量承担交付责任，但结算数额不超过乙方支付款项。</p>
    <h2>六、不可抗力</h2>
    <p>1、本协议所称不可抗力是指不能预见、不能克服、不能避免并对一方当事人造成重大影响的客观事件，包括自然灾害如洪水、地震、火灾、飓风和雷暴等以及社会事件如罢工、战争、政府行为等。</p>
      <p>2、如因不可抗力事件导致协议无法履行时，遇不可抗力的一方应立即通知另一方、及时采取措施防止损失扩大，并应在事件发生后7日内提供事故发生的详细书面资料，经另一方认可后双方协商处理。</p>
      <p>3、因不可抗力造成的任何一方的损失，相对方得以免责。</p>

    <h2>七、争议处理</h2>
    <p>本协议适用中华人民共和国法律解释。本协议在履行过程中发生的争议，由双方当事人协商解决；协商不成，依法向甲方所在地人民法院起诉。</p>

    <h2>八、生效及其他</h2>
    <p>本协议自乙方支付购买款项、甲方到账后即时生效。甲乙双方履行完合同约定的权利及义务后自然终止。</p>
  </div>
</template>

<script>
    export default {
      name: 'agreement'
    }
</script>
<style scoped>
  * {
    font-size: .26rem;
  }
  #agreement {
    padding-bottom: .4rem;
  }
  h1 {
    margin: .4rem 0 .3rem;
    font-size: .3rem;
    font-weight: bold;
    text-align: center;
  }
  h2 {
    margin-top: .35rem;
    margin-bottom: .2rem;
    font-weight: bold;
    font-size: .26rem;
    text-indent: .52rem;
  }
  h3 {
    text-indent: .52rem;
  }
  h4 {
    text-indent: 1.04rem;
  }
  p {
    margin: 0 .16rem;
    text-indent: .4rem;
    font-size: .26rem;
  }
  i {
    font-size: .26rem;
    /*color: red;*/
    font-style: normal;
  }
  small {
    /*color: #476d8f;*/
  }
  ul {
    margin: 0 .16rem;
  }
  li {
    text-indent: .4rem;
  }
  .space {
    display: inline-block;
    width: 2.75rem;
  }
  .underline {
    text-decoration: underline;
  }
  .line {
    display: inline-block;
    width: .6rem;
    border-bottom: 1px solid #4a4a4a;
  }
  .bold {
    font-weight: bold;
  }
</style>
